Klipper3d/klipper/lib/hc32f460/usb_lib/usb_core/usb_core_regs.h
            /** Stall Handshake */
            unsigned stall:1;

            /** Tx Fifo Number
             * IN EPn/IN EP0
             * OUT EPn/OUT EP0 - reserved */
            unsigned txfnum:4;

            /** Clear NAK */
            unsigned cnak:1;
            /** Set NAK */
            unsigned snak:1;
            /** Set DATA0 PID (INTR/Bulk IN and OUT endpoints)
             * Writing to this field sets the Endpoint DPID (DPID)
             * field in this register to DATA0. Set Even
             * (micro)frame (SetEvenFr) (ISO IN and OUT Endpoints)
             * Writing to this field sets the Even/Odd
             * (micro)frame (EO_FrNum) field to even (micro)
             * frame.
             */
            unsigned setd0pid:1;
            /** Set DATA1 PID (INTR/Bulk IN and OUT endpoints)
             * Writing to this field sets the Endpoint DPID (DPID)
             * field in this register to DATA1 Set Odd
             * (micro)frame (SetOddFr) (ISO IN and OUT Endpoints)
             * Writing to this field sets the Even/Odd
             * (micro)frame (EO_FrNum) field to odd (micro) frame.
             */
            unsigned setd1pid:1;

            /** Endpoint Disable */
            unsigned epdis:1;
            /** Endpoint Enable */
            unsigned epena:1;
}stc_bUSB_CORE_DEPCTL_t;  /* C-STAT */
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_DEPCTL_t b;  /* C-STAT */
} USB_CORE_DEPCTL_TypeDef;

typedef struct 
{
            /** Transfer size */
            unsigned xfersize:19;
/** Max packet count for EP (pow(2,10)-1) */
#define MAX_PKT_CNT 1023
            /** Packet Count */
            unsigned pktcnt:10;
            /** Multi Count - Periodic IN endpoints */
            unsigned mc:2;
            unsigned reserved:1;
}stc_bUSB_CORE_DEPXFRSIZ_t;
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_DEPXFRSIZ_t b;  /* C-STAT */
} USB_CORE_DEPXFRSIZ_TypeDef ;
typedef union 
{
    uint32_t d32;
    struct
    {
        /** Transfer size */
        unsigned xfersize:7;
        /** Reserved */
        unsigned reserved7_18:12;
        /** Packet Count */
        unsigned pktcnt:2;
        /** Reserved */
        unsigned reserved21_28:8;
        /**Setup Packet Count (DOEPTSIZ0 Only) */
        unsigned supcnt:2;
        unsigned reserved31;
    }
    b;
} USB_CORE_DEP0XFRSIZ_TypeDef ;

typedef struct 
{
    uint32_t fslspclksel :
        2;
    uint32_t fslssupp :
        1;
}stc_bUSB_CORE_HCFG_t;   /* C-STAT */
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_HCFG_t b;  /* C-STAT */
} USB_CORE_HCFG_TypeDef ;

typedef union 
{
    uint32_t d32;
    struct
    {
        uint32_t frint :
            16;
        uint32_t Reserved :
            16;
    }
    b;
} USB_CORE_HFRMINTRVL_TypeDef ;

typedef union 
{
    uint32_t d32;
    struct
    {
        uint32_t frnum :
            16;
        uint32_t frrem :
            16;
    }
    b;
} USB_CORE_HFNUM_TypeDef ;

typedef struct 
{
    uint32_t ptxfspcavail :
        16;
    uint32_t ptxqspcavail :
        8;
    struct
    {
        uint32_t terminate :
            1;
        uint32_t token :
            2;
        uint32_t chnum :
            4;
        uint32_t odd_even :
            1;
    } ptxqtop;
}stc_bUSB_CORE_HPTXSTS_t;  /* C-STAT */
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_HPTXSTS_t b;  /* C-STAT */
} USB_CORE_HPTXSTS_TypeDef ;

typedef struct 
{
    uint32_t prtconnsts :
        1;
    uint32_t prtconndet :
        1;
    uint32_t prtena :
        1;
    uint32_t prtenchng :
        1;
    uint32_t prtovrcurract :
        1;
    uint32_t prtovrcurrchng :
        1;
    uint32_t prtres :
        1;
    uint32_t prtsusp :
        1;
    uint32_t prtrst :
        1;
    uint32_t Reserved9 :
        1;
    uint32_t prtlnsts :
        2;
    uint32_t prtpwr :
        1;
    uint32_t prttstctl :
        4;
    uint32_t prtspd :
        2;
    uint32_t Reserved19_31 :
        13;
}stc_bUSB_CORE_HPRT0_t;   /* C-STAT */
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_HPRT0_t b;  /* C-STAT */
} USB_CORE_HPRT_TypeDef ;

typedef struct 
{
    uint32_t chint :
        16;
    uint32_t Reserved :
        16;
}stc_bUSB_CORE_HAINT_t; /* C-STAT */
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_HAINT_t b;  /* C-STAT */
} USB_CORE_HAINT_TypeDef ;

typedef union 
{
    uint32_t d32;
    struct
    {
        uint32_t chint :
            16;
        uint32_t Reserved :
            16;
    }
    b;
} USB_CORE_HAINTMSK_TypeDef ;

typedef struct 
{
    uint32_t mps :
        11;
    uint32_t epnum :
        4;
    uint32_t epdir :
        1;
    uint32_t Reserved :
        1;
    uint32_t lspddev :
        1;
    uint32_t eptype :
        2;
    uint32_t multicnt :
        2;
    uint32_t devaddr :
        7;
    uint32_t oddfrm :
        1;
    uint32_t chdis :
        1;
    uint32_t chen :
        1;
}stc_bUSB_CORE_HCCHAR_t;   /* C-STAT */
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_HCCHAR_t b;  /* C-STAT */
} USB_CORE_HCCHAR_TypeDef ;

typedef union 
{
    uint32_t d32;
    struct
    {
        uint32_t prtaddr :
            7;
        uint32_t hubaddr :
            7;
        uint32_t xactpos :
            2;
        uint32_t compsplt :
            1;
        uint32_t Reserved :
            14;
        uint32_t spltena :
            1;
    }
    b;
} USB_CORE_HCSPLT_TypeDef ;


/* Bit define for C-STAT */
#define hc_xfercompl    (0x000000001ul)
#define hc_chhltd       (0x000000002ul)
#define hc_ahberr       (0x000000004ul)
#define hc_stall        (0x000000008ul)
#define hc_nak          (0x000000010ul)
#define hc_ack          (0x000000020ul)
#define hc_nyet         (0x000000040ul)
#define hc_xacterr      (0x000000080ul)
#define hc_bblerr       (0x000000100ul)
#define hc_frmovrun     (0x000000200ul)
#define hc_datatglerr   (0x000000400ul)

typedef struct 
{
    uint32_t xfercompl :
        1;
    uint32_t chhltd :
        1;
    uint32_t ahberr :
        1;
    uint32_t stall :
        1;
    uint32_t nak :
        1;
    uint32_t ack :
        1;
    uint32_t nyet :
        1;
    uint32_t xacterr :
        1;
    uint32_t bblerr :
        1;
    uint32_t frmovrun :
        1;
    uint32_t datatglerr :
        1;
    uint32_t Reserved :
        21;
}stc_bUSB_CORE_HCINTn_t;  /* C-STAT */
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_HCINTn_t b; /* C-STAT */
} USB_CORE_HCINTn_TypeDef ;

typedef struct 
{
    uint32_t xfersize :
        19;
    uint32_t pktcnt :
        10;
    uint32_t pid :
        2;
    uint32_t dopng :
        1;
}stc_bUSB_CORE_HCTSIZn_t;   /* C-STAT */
typedef union 
{
    uint32_t d32;
    stc_bUSB_CORE_HCTSIZn_t b; /* C-STAT */
} USB_CORE_HCTSIZn_TypeDef ;

typedef union 
{
    uint32_t d32;
    struct
    {
        uint32_t xfercompl :
            1;
        uint32_t chhltd :
            1;
        uint32_t ahberr :
            1;
        uint32_t stall :
            1;
        uint32_t nak :
            1;
        uint32_t ack :
            1;
        uint32_t nyet :
            1;
        uint32_t xacterr :
            1;
        uint32_t bblerr :
            1;
        uint32_t frmovrun :
            1;
        uint32_t datatglerr :
            1;
        uint32_t Reserved :
            21;
    }
    b;
} USB_CORE_HCINTMSK_TypeDef ;

typedef union 
{
    uint32_t d32;
    struct
    {
        /** Stop Pclk */
        unsigned stoppclk:1;
        /** Gate Hclk */
        unsigned gatehclk:1;
        /** Power Clamp */
        unsigned pwrclmp:1;
        /** Reset Power Down Modules */
        unsigned rstpdwnmodule:1;
        /** Reserved */
        unsigned reserved:1;
        /** Enable Sleep Clock Gating (Enbl_L1Gating) */
        unsigned enbl_sleep_gating:1;
        /** PHY In Sleep (PhySleep) */
        unsigned phy_in_sleep:1;
        /** Deep Sleep*/
        unsigned deep_sleep:1;
        unsigned resetaftsusp:1;
        unsigned restoremode:1;
        unsigned enbl_extnd_hiber:1;
        unsigned extnd_hiber_pwrclmp:1;
        unsigned extnd_hiber_switch:1;
        unsigned ess_reg_restored:1;
        unsigned prt_clk_sel:2;
        unsigned port_power:1;
        unsigned max_xcvrselect:2;
        unsigned max_termsel:1;
        unsigned mac_dev_addr:7;
        unsigned p2hd_dev_enum_spd:2;
        unsigned p2hd_prt_spd:2;
        unsigned if_dev_mode:1;
    }
    b;
} USB_CORE_PCGCCTL_TypeDef ;

#endif //__USB_CORE_REGS_H__

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/

